// See https://aka.ms/new-console-template for more information

// 0. напишите программу, которая на вход принимает число и выдает его квадрат (умножает само на себя)

string s_a = Console.ReadLine()!;
int a = int.Parse(Console.ReadLine()!);

Console.WriteLine(a * a);
